# NewSpaceBoundaryLines Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewSpaceBoundaryLines Method
Document Class See Also
---
Creates a new boundary line as an Space border.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ModelCurveArray NewSpaceBoundaryLines(
	SketchPlane sketchPlane,
	CurveArray curves,
	View view
)
```

Visual Basic
---
```text
Public Function NewSpaceBoundaryLines ( _
	sketchPlane As SketchPlane, _
	curves As CurveArray, _
	view As View _
) As ModelCurveArray
```

Visual C++
---
```text
public:
ModelCurveArray^ NewSpaceBoundaryLines(
	SketchPlane^ sketchPlane,
	CurveArray^ curves,
	View^ view
)
```

# ### Parameters
sketchPlane
    Type: Autodesk.Revit.DB..::..SketchPlaneThe sketch plan
curves
    Type: Autodesk.Revit.DB..::..CurveArrayThe geometry curves on which the boundary lines are
view
    Type: Autodesk.Revit.DB..::..ViewThe View for the new Space
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the sketch plane does not exist in the given document. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the view does not exist in the given document. |

# See Also
Document Class
Autodesk.Revit.Creation Namespace